package sampleData

type GeoCode struct {
	Lat  float64
	Lng  float64
	Name string
}

func GetThisLocation() GeoCode {
	return GeoCode{
		Lat:  33.591374155828156,
		Lng:  130.39893980701768,
		Name: "天神駅",
	}
}

func GetSampleData() []GeoCode {
	// https://goo.gl/maps/zKDp7Pxa5Nu74ydX7
	return []GeoCode{
		{Lat: 33.59083530042847, Lng: 130.39804301901623, Name: "福岡PARCO 新館"},
		{Lat: 33.593352213254406, Lng: 130.38517340455206, Name: "ローソン 福岡長浜屋台通り店"},
		{Lat: 33.593503987936955, Lng: 130.38934675089243, Name: "セブンイレブン 福岡長浜２丁目店"},
		{Lat: 33.59354931610593, Lng: 130.39056846360478, Name: "トヨタカローラ福岡（株）本店"},
		{Lat: 33.59395984073447, Lng: 130.3942819025142, Name: "ローソン 福岡舞鶴交番前店"},
		{Lat: 33.59274424647681, Lng: 130.3968358214446, Name: "博多らーめん ShinShin 天神本店"},
		{Lat: 33.59289637354958, Lng: 130.3990237797287, Name: "福岡中央郵便局"},
		{Lat: 33.5941297465123, Lng: 130.40043999751958, Name: "セブンイレブン 福岡天神４丁目店"},
		{Lat: 33.59401417915588, Lng: 130.40440946379204, Name: "三井ガーデンホテル福岡中洲"},
		{Lat: 33.59367164098994, Lng: 130.40671624388096, Name: "セブンイレブン博多中洲３丁目店"},
		{Lat: 33.593476712257846, Lng: 130.40101929138552, Name: "ファミリーマート 福岡天神四丁目店"},
		{Lat: 33.59144914931455, Lng: 130.39511900917648, Name: "セブンイレブン福岡舞鶴店"},
		{Lat: 33.59159159787721, Lng: 130.4023508564149, Name: "アクロス福岡"},
		{Lat: 33.587909933039455, Lng: 130.39698563615832, Name: "Apple福岡"},
		{Lat: 33.58939315649221, Lng: 130.39934652635563, Name: "ローソン 西鉄福岡天神駅改札内店"},
		{Lat: 33.58854517084318, Lng: 130.40237713279487, Name: "天神南駅"},
		{Lat: 33.58934809790688, Lng: 130.39145027359436, Name: "ホテルJALシティ福岡 天神"},
		{Lat: 33.5854514807356, Lng: 130.39361678525108, Name: "セブンイレブン福岡大名１丁目店"},
		{Lat: 33.59524671492478, Lng: 130.3965355508925, Name: "ローソン 天神北店"},
		{Lat: 33.58559608073559, Lng: 130.39745753923523, Name: "ローソン 福岡今泉一丁目店"},
		{Lat: 33.59053712651258, Lng: 130.40121153392215, Name: "ローソン 福岡市役所店"},
	}
}
